//DMAVR-M16中断式独立键盘示例程序，键值变化不稳，因为键盘硬件的抖动原因
//两个中断键盘进行加1或者减1计数
//新版GCCAVR编译器用ISR代替了老版的SIGNAL函数，中断向量名称可以根据iom128.h查阅
//包含头文件也有signal.h替换为interrupt.h
//编译环境 AVR Studio 4.17/AVR GCC
//系统时钟7.3728MHZ，设置熔丝位为外部高频石英晶体振荡，启动时间4.1ms
//作者：阿迪 www.avrgcc.com
//日期：2010.01.14
//***********************************************************************
//			包含文件
//***********************************************************************

#include <string.h>
#include <stdio.h>
#define	 F_CPU	7372800		// 单片机主频为7.3728MHz,用于延时子程序
#include <util/delay.h>
#include <avr/io.h>
#include <avr/iom128.h>
#include <avr/interrupt.h>    //中断信号头文件


#define Data_IO	        PORTA                //数据口
#define Data_DDR        DDRA                 //数据口方向寄存器
#define D_LE0	        PORTD &= ~(1 << PD4) //数码管段控制位为0
#define D_LE1           PORTD |= (1 << PD4)  //数码管段控制位为1
#define W_LE0	        PORTD &= ~(1 << PD5) //数码管位控制位为0
#define W_LE1           PORTD |= (1 << PD5)  //数码管位控制位为1

#define delay_us(x)     _delay_us(x)    //AVR GCC延时函数 x(us)
#define delay_ms(x)     _delay_ms(x)    //AVR GCC延时函数 x(ms)

#define uchar           unsigned char
#define uint            unsigned int

uchar count;                                  //定义键盘计数变量

//***********************************************************************
//			共阴数码管显示的断码表
//***********************************************************************

uchar table[]={0x3f,0x06,0x5b,0x4f,0x66,0x6d,0x7d,0x07,0x7f,0x6f,0x77,0x7c,0x39,0x5e,0x79,0x71};

//***********************************************************************
//			IO端口初始化
//***********************************************************************

void system_init()
{
    Data_IO=0xFF;             //数据口为输出
    Data_DDR=0xFF;

	PORTD=0x7F;               //PD0 PD1设置为输入
	DDRD=0x70;                //PD0 PD1上拉电阻使能有效
}

//*************************************************************************
//			74HC573控制数码管动态扫描显示函数
//*************************************************************************

void Display_Key(uchar num)
{
	 uchar i,j;
	 system_init();
     j=0x01;                    //此数据用来控制位选
  for(i=0;i<8;i++)
  {
    D_LE1;                    //控制数码管段数据的74HC573的LE管脚置高
    W_LE1;                    //控制数码管位的74HC573的LE管脚置高
    Data_IO=0x00;               //设置要显示的位，也就是哪一个数码管亮，这里是八个一起显示
    W_LE0;                    //锁存位数据，下面送上段数据以后，就显示出来了
	j=(j<<1);
    Data_IO=table[num];         //送要显示的数据，就是段数据，如显示0送的是0x3f
    D_LE0;                    //锁存段数据，数码管亮一个时间片刻
    delay_ms(1);              //显示一个时间片刻，会影响亮度和闪烁性

  }

}

void interrupt_init()
{
  EIMSK|=0x03;                                     //使能外部中断0和外部中断1
  EICRA=0x0A;                                     //下降沿触发方式
  MCUCSR=0x00;                                    //控制和状态寄存器初始化
}

//*************************************************************************
//	   中断服务子程序
//*************************************************************************

ISR(INT0_vect,ISR_NOBLOCK)                   //中断0服务程序
{
 if(++count>=16) 
   count=0;
}


ISR(INT1_vect)                   //中断1服务程序
{
 if(count) --count;
 else count=15;
}


//*************************************************************************
//			主程序
//*************************************************************************
int main(void)
{
  system_init();                             //系统初始化
  interrupt_init();                          //中断配置初始化
  SREG|=0x80;                                //开启全局中断
  while(1)
  {
    Display_Key(count);                          //显示键值
  }
}
