
/*===================================================================================================  
工程名称：  Ex2_TP
功能描述：	采集触摸点坐标，显示在TFT上
硬件连接：  查看和修改接口定义在NBCTFT.C与TP.C中,请仔细检查接口连线后上电测试。
      ----------------------------------------
     |     --------TFT控制接线----------      |
     |	        D10~D17   接   P0             |
     |          RS        接   P2^5;	      |
     |			RW   	  接   P2^4;          |
     |			RD        接   P2^3;          |
     |		    CS        接   P2^2;	      |
     |			RES       接   P2^1;	      |
     |	                                      |
     |			LE        接   P2^0;          |
     |	                                      |
     |     --------电源供电接线---------      |
     |	        GND       接   电源负极       |
     |	        VIN       接   电源正极(5V)   |
     |----------------------------------------|
     | 如果在NBC开发板上使用，以上线不需用飞  |
     | 线连接，直接插接在开发板上的12864接口  |
     | 后只需连接以下接线                     |
     |----------------------------------------|
     |     --------触摸控制接线---------      |
     |          PEN       接   P3^2;	      |
     |			TPDO   	  接   P3^3;          |
     |			BUSY      接   P3^4;          |
     |		    TPDI      接   P3^5;	      |
     |			TPCS      接   P3^6;	      |
	 |			CLK       接   P3^7;	      |
	  ----------------------------------------
维护记录：  2012-3-14
====================================================================================================*/

//******************包含头文件***************************
#include <reg51.h>
#include <intrins.h>
#include <TP.H>
#include <NBCTFT.H>


//******************全局变量***************************
unsigned int Device_code;

/* LCD color */
#define White          0xFFFF
#define Black          0x0000
#define Blue           0x001F
#define Blue2          0x051F
#define Red            0xF800
#define Magenta        0xF81F
#define Green          0x07E0
#define Cyan           0x7FFF
#define Yellow         0xFFE0




//================================================================================================
//	函数名称：	画点函数
//	实现功能：	在触摸点位置画点
//================================================================================================
 
void drawpoint(unsigned int x,unsigned int y,unsigned int color)
{
    LCD_SetPos(x,x+1,y,y+1);
	Write_Data_U16(color);
	Write_Data_U16(color);
	Write_Data_U16(color);
	Write_Data_U16(color);
} 

//================================================================================================
//	函数名称：	主函数
//	实现功能：	采集触摸点坐标，显示在TFT上
//	参数：		无
//	返回值：	无
//================================================================================================
main()
{
    Device_code=0x9320;
	TFT_Initial();   //tft初始化
    start_7843();

    CLR_Screen(Blue); //清屏				
	
  	LCD_PutString(16,5,"Please write on the board!",Magenta,Blue);
   	while(1)
	{	

     if(Getpix()==1)
	   drawpoint(lx,ly,Red); //写（x，y）点为红色

    }
}



