//DMAVR-128的8位独发光二极管闪烁示例程序
//编译环境 ICCAVR V7.16A
//系统时钟7.3728MHZ，设置熔丝位为外部高频石英晶体振荡，启动时间4.1ms
//作者：阿迪 www.avrgcc.com
//日期：2010.01.26
//***********************************************************************
//			包含文件
//***********************************************************************

#include <string.h>
#include <stdio.h>
#include <iom128v.h>						   //Atmega128头文件						 
#include <delay.h> 							   //延时程序头文件，针对7.3728M时钟						  														 	

#define LED8            PORTB                  //LED发光管与PB口相连接

//*************************************************************************
//			系统初始化子程序
//*************************************************************************
void System_init()
{
  DDRB=0xff;                                  //设置PB口为输出
  LED8=0xff;
}


//*************************************************************************
//			主程序
//*************************************************************************
void main()
{
  System_init();                             //系统初始化
  while(1)
  {
    LED8=0x00;           
	delay_nms(500);		 					 //延时500ms
    LED8=0xff;
    delay_nms(500);
	
  }
}
