//DMAVR-128的定时器实现快速PWM输出示例程序，定时器0溢出中断的方式
//PWM输出通过控制LED发光来直观的看到效果，改变OCR0的值，可以控制亮度
//编译环境 AVR Studio 4.17/AVR GCC
//系统时钟7.3728MHZ，设置熔丝位为外部高频石英晶体振荡，启动时间4.1ms
//作者：阿迪 www.avrgcc.com
//日期：2010.01.14
//***********************************************************************
//			包含文件
//***********************************************************************

#include <string.h>
#include <stdio.h>
#define	 F_CPU	7372800		// 单片机主频为7.3728MHz,用于延时子程序
#include <util/delay.h>
#include <avr/io.h>
#include <avr/iom128.h>
#include <avr/interrupt.h>     //中断信号头文件

//***********************************************************************
//			定义变量区
//***********************************************************************
#define f_count         25                              //0CR0寄存器初始值
#define timer_clk       0x07
#define delay_us(x)     _delay_us(x)    				//AVR GCC延时函数 x(us)
#define delay_ms(x)     _delay_ms(x)    				//AVR GCC延时函数 x(ms)

#define uchar           unsigned char
#define uint            unsigned int
#define ulong           unsigned long


//*************************************************************************
//			初始化子程序
//*************************************************************************
void system_init()                                   //IO口初始化
{
  
  PORTB=0xff;                                       //PB设置为输出
  DDRB=0xff;                                        //上拉电阻无效
}

void timer0_init()                                 //定时器初始化
{
  TCCR0=0x68|timer_clk;                            //快读PWM模式，OC0输出，分频
  OCR0=f_count;                                    //OCR0比较匹配寄存器值
  TIFR=0x01;                                       //清中断标志位
  TIMSK=0x01;                                      //使能定时器0溢出中断
}


//*************************************************************************
//		定时器0中断服务子程序
//*************************************************************************
ISR(SIG_OVERFLOW0)                           	//中断服务程序
{
  OCR0=f_count;                                 //相关操作
}

//*************************************************************************
//		主程序
//*************************************************************************

int main(void)
{
  system_init();                             //系统初始化.PB4输出PWM波形
  timer0_init();                             //定时器0初始化，完成PWM相关配置
  SREG|=0x80;                                //开启全局中断
  while(1)
  {
  }
}
