//ATMEGA128的定时器实现快速PWM输出示例程序，定时器0溢出中断的方式
//PWM输出通过控制LED发光来直观的看到效果，改变OCR0的值，可以控制亮度
//编译环境 ICCAVR 7.16A
//系统时钟7.3728MHZ，设置熔丝位为外部高频石英晶体振荡，启动时间4.1ms
//忠兴电子元件店编辑
//日期：2010.01.14

//***********************************************************************
//			包含文件
//***********************************************************************

#include <string.h>
#include <stdio.h>
#include <delay.h>
#include <iom128v.h>

//***********************************************************************
//			定义变量区
//***********************************************************************
#define f_count         25                    //0CR0寄存器初始值
#define timer_clk       0x07

#define uchar           unsigned char
#define uint            unsigned int

#define Data_IO	        PORTA                //数码管数据口
#define Data_DDR        DDRA                 //数码管数据口方向寄存器
#define D_LE0	        PORTD &= ~(1 << PD4) //数码管段控制位为0，锁存端口数据
#define D_LE1           PORTD |= (1 << PD4)  //数码管段控制位为1，锁存器输出与端口一致
#define W_LE0	        PORTD &= ~(1 << PD5) //数码管位控制位为0
#define W_LE1           PORTD |= (1 << PD5)  //数码管位控制位为1

//*************************************************************************
//			初始化子程序
//*************************************************************************
void system_init()                                   //IO口初始化
{
  
  PORTB=0xff;                                       //PB设置为输出
  DDRB=0xff;                                        //上拉电阻无效
  
  D_LE1;//关掉数码管，以免显示乱码                   
  W_LE1;
  Data_IO=0xFF;//关数码管            
  W_LE0;

}

void timer0_init()                                 //定时器初始化
{
  TCCR0=0x68|timer_clk;                            //快读PWM模式，OC0输出，1024分频
  OCR0=f_count;                                    //OCR0比较匹配寄存器值
  TIFR=0x01;                                       //清中断标志位
  TIMSK=0x01;                                      //使能定时器0溢出中断
}


//*************************************************************************
//		定时器0中断服务子程序
//*************************************************************************
#pragma interrupt_handler  TIMER0_ISR:17
void TIMER0_ISR() 	 	
{
  OCR0=f_count;                                 //改变OCR0的值可以改变PWM输出
}

//*************************************************************************
//		主程序
//*************************************************************************

void main(void)
{
  system_init();                             //系统初始化.PB4输出PWM波形
  timer0_init();                             //定时器0初始化，完成PWM相关配置
  SREG|=0x80;                                //开启全局中断
  while(1)
  {
  }
}
