
/*===================================================================================================  
工程名称：  Ex2 TP
功能描述：  采集触摸点坐标，显示在TFT上
硬件连接：  查看和修改接口定义在NBCTFT.C与TP.C中,请仔细检查接口连线后上电测试。
      ----------------------------------------
     |     --------TFT控制接线----------      |
     |	                                      |
     |	    D10~D17   接   RB0~RB7            |
     |      RS        接   RD5	              |
     |		RW   	  接   RD4                |
     |		RD        接   RD3                |
     |		CS        接   RD2	   		      |
     |		RES       接   RD1                |
     |	                                      |
     |		LE        接   RD0                |
     |                                        |
     |     --------电源供电接线---------      |
     |	    GND       接   电源负极           |
     |	    VIN       接   电源正极(5V)       |
     |----------------------------------------|
     | 如果在NBC开发板上使用，以上线不需用飞  |
     | 线连接，直接插接在开发板上的12864接口  |
     | 后只需连接以下接线                     |
     |----------------------------------------|
     |     --------触摸控制接线---------      | 
     |      PEN       接   RC2 	              | 
     |		TPDO   	  接   RC3                |  
     |		BUSY      接   RC4                | 
     |		TPDI      接   RC5 	              |  
     |		TPCS      接   RC6	              | 
     |	    CLK       接   RC7	              |  
      ----------------------------------------

维护记录：  2012-3-30
====================================================================================================*/

//******************包含头文件***************************

#include <pic.h> //头文件在HI-TECH安装目录下\HI-TECH Software\PICC\std\9.60\include
#include"NBCTFT.h"   //包含TFT驱动头文件
#include "TP.H"

//******************全局变量***************************

#define White          0xFFFF   //LCD color
#define Black          0x0000
#define Blue           0x001F
#define Blue2          0x051F
#define Red            0xF800
#define Magenta        0xF81F
#define Green          0x07E0
#define Cyan           0x7FFF
#define Yellow         0xFFE0

unsigned int Device_code;      //TFT控制IC型号

bank1 unsigned char tab[]={"Please write on the board!"};         

//**************声明外部函数和变量********************

extern void delayms(unsigned int count);


//***********************************************************************************
//IO初始化操作
//***********************************************************************************
void IO_init(void)
{
	TRISD=0x00;       //RD设置为输出
	PORTD=0xff;       //初始化为高
	
	TRISB=0x00;       //RB设置为输出
	PORTB=0xff;       //初始化为高
              
	TRISC=0x00;       //RC设置为输出
	PORTC=0xff;       //初始化为高
        
}

//================================================================================================
//	函数名称：	画点函数
//	实现功能：	在触摸点位置画点
//================================================================================================
 
void drawpoint(unsigned int x,unsigned int y,unsigned int color)
{
    LCD_SetPos(x,x+1,y,y+1);
	Write_Data_U16(color);
	Write_Data_U16(color);
	Write_Data_U16(color);
	Write_Data_U16(color);
} 

//================================================================================================
//	函数名称：	主函数
//	实现功能：	采集触摸点坐标，显示在TFT上
//	参数：		无
//	返回值：	无
//================================================================================================
main()
{
    Device_code=0x9320;
    __CONFIG(XT&WDTDIS&LVPDIS);//配置，设置为晶振XT方式振荡，禁看门狗，禁低电压编程
    IO_init();                 //IO初始化 
    
    TFT_Initial();             //tft初始化
    start_7843();

    CLR_Screen(Blue);          //清屏				
	LCD_PutString(16,5,tab,Magenta,Blue);

   	while(1)
	{	
       if(Getpix()==1)
	   drawpoint(lx,ly,Red);    //写（x，y）点为红色

    }
}



