/*
*********************************************************************************************************
*                                           Atmel ATmega128
*                                         Board Support Package
*
*                                (c) Copyright 2005, Micrium, Weston, FL
*                                          All Rights Reserved
*
*
* File : BSP.H
* By   : Jean J. Labrosse
*********************************************************************************************************
*/

/*
*********************************************************************************************************
*                                               CONSTANTS
*********************************************************************************************************
*/
								/* MCU时钟频率 10Mhz*/
#define	F_OSC_DIV	0x4											/* 定时器分频系数.注意,为实际写入TCCRx的值*/
#define	TIMER_INTERVAL	0x9c									/* 时钟中断周期,以时钟分频后的时钟为基准 */

#define  CPU_CLK_FREQ                  7372800//3684000L


/*
*********************************************************************************************************
*                                           FUNCTION PROTOTYPES
*********************************************************************************************************
*/

void BSP_Init(void);

void TimerInit(void);

void BSP_TickISR(void);
void BSP_TickISR_Handler(void);

void LED_On(INT8U led);
void LED_Off(INT8U led);
void LED_Toggle(INT8U led);
